tutorials/multiphaseReactiveTransport/interReactiveTransferFoam/2DCavity/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.1";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0); 
boundaryField
{
    bottom
    {
         type           fixedValue;
         value           uniform (0 0 0);
       
    }
    top
    {
        type           fixedValue;
         value           uniform (0 0 0);
    }
    left
    {
        type           fixedValue;
         value           uniform (1.665e-4 0 0);
    }
    right
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
