tutorials/multiphaseReactiveTransport/interReactiveTransferFoam/2DCavity/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 1
    volScalarFieldValue CO2 0
    volScalarFieldValue H+ 9.97413e-8 
    volScalarFieldValue OH- 1.00954e-7
);

regions
(
    boxToCell
    {
        box (0.002 -0.002 0) (0.004 -0.0001 0.002);

        fieldValues
        (
            volScalarFieldValue alpha1 0
            volScalarFieldValue CO2 0.0425 
            volScalarFieldValue H+ 0
            volScalarFieldValue OH- 0
        );
    }

);

// ************************************************************************* //
